YasaswiniK13/STM32_Peripheral_Interface_Development/I2C_TempSensorDriverInterrupt/Core/Src/main.c
	//while(writeComplete == 0);
	//writeComplete = 0;

	vTaskSuspend(pTempSensorRead);
}

static void TempSensorRead(void *parameter)
{
  char tempReading[100];
  float tempValue =0;

  MyTSENSOR_init();

  while(1)
  {
	  //tempValue = BSP_TSENSOR_ReadTemp();
	  tempValue = MyTSENSOR_ReadTemp();
	  int tempValueInt=tempValue;
	  float tempValueFrac=0;

	  tempValueFrac = tempValue - tempValueInt;
	  int tempValueFrac2digits = trunc(tempValueFrac * 100);

	  snprintf(tempReading, 100, "\r\n TEMPERATURE = %1d.%0.2d \n\r", tempValueInt, tempValueFrac2digits);
      HAL_UART_Transmit(&huart1, (uint8_t *)tempReading, strlen(tempReading), 1000);

      vTaskDelay(5000);
  }
}

static float MyTSENSOR_ReadTemp()
{
	int16_t T0_out, T1_out, T_out, T0_degC_x8_u16, T1_degC_x8_u16;
	  int16_t T0_degC, T1_degC;
	  uint8_t buffer[4], tmp;
	  float tmp_f;

	  //SENSOR_IO_ReadMultiple(DeviceAddr, (HTS221_T0_DEGC_X8 | 0x80), buffer, 2);
	  //HTS221_T0_DEGC_X8: Address 32
	  //HAL_I2C_Mem_Read(hi2c, DevAddress, MemAddress, MemAddSize, pData, Size, Timeout);
	  //HAL_I2C_Mem_Read(&hi2c2, 0xBF, 0x32 | 0x80, 0x1U, buffer, 2, 1000);
	  HAL_I2C_Mem_Read_IT(&hi2c2, 0xBF, 0x32 | 0x80, 0x1U, buffer, 2);
	  //while(readComplete == 0);
	  //readComplete = 0;

	  vTaskSuspend(pTempSensorRead);

	  //tmp = SENSOR_IO_Read(DeviceAddr, HTS221_T0_T1_DEGC_H2);
	  //HTS221_T0_T1_DEGC_H2: Address 0x35
	  //HAL_I2C_Mem_Read(hi2c, DevAddress, MemAddress, MemAddSize, pData, Size, Timeout);
	  //HAL_I2C_Mem_Read(&hi2c2, 0xBF, 0x35, 0x1U, &tmp,1, 1000);
	  HAL_I2C_Mem_Read_IT(&hi2c2, 0xBF, 0x35, 0x1U, &tmp,1);
	  //while(readComplete == 0);
	  //readComplete = 0;

	  vTaskSuspend(pTempSensorRead);

	  T0_degC_x8_u16 = (((uint16_t)(tmp & 0x03)) << 8) | ((uint16_t)buffer[0]);
	  T1_degC_x8_u16 = (((uint16_t)(tmp & 0x0C)) << 6) | ((uint16_t)buffer[1]);
	  T0_degC = T0_degC_x8_u16 >> 3;
	  T1_degC = T1_degC_x8_u16 >> 3;

	  //SENSOR_IO_ReadMultiple(DeviceAddr, (HTS221_T0_OUT_L | 0x80), buffer, 4);
	  //HTS221_T0_OUT_L: Address 0x3C
	  //HAL_I2C_Mem_Read(hi2c, DevAddress, MemAddress, MemAddSize, pData, Size, Timeout);
	  //HAL_I2C_Mem_Read(&hi2c2, 0xBF, 0x3C | 0x80, 0x1U, buffer, 4, 1000);
	  HAL_I2C_Mem_Read_IT(&hi2c2, 0xBF, 0x3C | 0x80, 0x1U, buffer, 4);
	  //while(readComplete == 0);
	  //readComplete = 0;

	  vTaskSuspend(pTempSensorRead);

	  T0_out = (((uint16_t)buffer[1]) << 8) | (uint16_t)buffer[0];
	  T1_out = (((uint16_t)buffer[3]) << 8) | (uint16_t)buffer[2];

	  //SENSOR_IO_ReadMultiple(DeviceAddr, (HTS221_TEMP_OUT_L_REG | 0x80), buffer, 2);
      //HTS221_TEMP_OUT_L_REG: Address 0x2A
	  //HAL_I2C_Mem_Read(hi2c, DevAddress, MemAddress, MemAddSize, pData, Size, Timeout);
	  //HAL_I2C_Mem_Read(&hi2c2, 0xBF, 0x2A | 0x80, 0x1U, buffer, 2, 1000);
	  HAL_I2C_Mem_Read_IT(&hi2c2, 0xBF, 0x2A | 0x80, 0x1U, buffer, 2);
	  //while(readComplete == 0);
	  //readComplete = 0;

	  vTaskSuspend(pTempSensorRead);

	  T_out = (((uint16_t)buffer[1]) << 8) | (uint16_t)buffer[0];

	  tmp_f = (float)(T_out - T0_out) * (float)(T1_degC - T0_degC) / (float)(T1_out - T0_out)  +  T0_degC;

	  return tmp_f;
}


void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	/*BaseType_t xHigherPriorityTaskWoken;
	xHigherPriorityTaskWoken = pdFALSE;

    xQueueSendFromISR(pUARTQueue, &receiveBuf, xHigherPriorityTaskWoken);
    HAL_UART_Receive_IT(&huart1, &receiveBuf, 1);*/
}

void HAL_I2C_MemRxCpltCallback(I2C_HandleTypeDef *hi2c)
{
	//readComplete = 1;
	xTaskResumeFromISR(pTempSensorRead);
}

void HAL_I2C_MemTxCpltCallback(I2C_HandleTypeDef *hi2c)
{
	//writeComplete = 1;
	xTaskResumeFromISR(pTempSensorRead);
}

/* USER CODE END 4 */

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {

  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
